<script setup lang="ts">
import Panel from 'primevue/panel';
</script>

<template>
  <Panel header="Описание параметров" toggleable collapsed>
    <div class="space-y-3">
      <p>
        Для проведения бэктеста вам необходимо заполнить следующие параметры:
      </p>

      <ol class="list-decimal space-y-2 pl-5">
        <li>
          <b>Актив</b> - Выберите актив (например, BTC/USDT), который вы хотите
          использовать для бэктеста. Это актив, на котором будет проводиться
          тестирование вашей стратегии.
        </li>
        <li>
          <b>Шаг</b> - Выберите временной интервал (например, 15 минут), который
          будет использоваться для бэктеста. Это шаг, с которым будут собираться
          исторические данные для тестирования.
        </li>
        <li>
          <b>Сетка</b> - Выберите сетку, которую вы хотите использовать для
          бэктеста. Сетка - это набор уровней, на которых выбранная стратегия
          будет открывать и закрывать сделки.
        </li>
        <li>
          <b>Диапазон дат</b> - Выберите диапазон дат для бэктеста. Это период
          времени, за который будут собираться исторические данные для
          тестирования.
        </li>
      </ol>

      <p>
        После заполнения всех полей, вы можете нажать кнопку "Рассчитать" для
        запуска бэктеста. Если во время бэктеста вам потребуется остановить
        процесс, вы можете нажать кнопку "Остановить" и вам выведется результат
        уже полученных данных.
      </p>
    </div>
  </Panel>
</template>
